app/controllers/pictures_controller.rb

	def create
		@picture = Picture.new(picture_params)
		if @picture.save
---
INSERT INTO "pictures" ("artist", "created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["artist", "test"], ["created_at", Mon, 04 Nov 2013 23:42:06 UTC +00:00], ["title", "teat"], ["updated_at", Mon, 04 Nov 2013 23:42:06 UTC +00:00], ["url", "teats"]]